# pymysql

## 설치

In [1]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\programdata\anaconda3\lib\site-packages (1.1.2)

## 준비

In [22]:
import pymysql as DBMS
import pandas as pd

def connect_db(database=""):
    try:
        db = DBMS.connect(host="localhost", port=3306, user="root", password="SeSAC_AI_3rd", charset="utf8", database=database)
        print(type(db), "connect", database)
        cursor = db.cursor()
        print(type(cursor))
        return db, cursor
    except Exception as e:
        print("[NG]", type(e), e)
        raise e

def show_databases(cursor):
    try:
        sql = "SHOW DATABASES"
        result = cursor.execute(sql)
        print(type(result), result, sql)
        result_tuple = cursor.fetchall()
        print(type(result_tuple))
        for row in result_tuple:
            print(len(row), row)
    except Exception as e:
        print("[NG]", type(e), e)
        raise e

def select_database(cursor):
    try:
        sql = "SELECT DATABASE()"
        result = cursor.execute(sql)
        print(type(result), result, sql)
        result_tuple = cursor.fetchall()
        print(type(result_tuple))
        for row in result_tuple:
            print(len(row), row)
    except Exception as e:
        print("[NG]", type(e), e)
        raise e

def use_database(cursor, database):
    try:
        sql = "USE " + database
        result = cursor.execute(sql)
        print(type(result), result, sql)
    except Exception as e:
        print("[NG]", type(e), e)
        raise e

def show_tables(cursor):
    try:
        sql = "SHOW TABLES"
        result = cursor.execute(sql)
        print(type(result), result, sql)
        result_tuple = cursor.fetchall()
        print(type(result_tuple))
        for row in result_tuple:
            print(len(row), row)
    except Exception as e:
        print("[NG]", type(e), e)
        raise e

def desc_table(cursor, table):
    try:
        sql = "DESC " + table
        result = cursor.execute(sql)
        print(type(result), result, sql)
        result_tuple = cursor.fetchall()
        print(type(result_tuple))
        for row in result_tuple:
            print(len(row), row)
    except Exception as e:
        print("[NG]", type(e), e)
        raise e

def execute_sql(cursor, sql):
    try:
        result = cursor.execute(sql)
        print(type(result), result, sql)
    except Exception as e:
        print("[NG]", type(e), e, "\n", sql)
        raise e

### SHOW DATABASES

In [3]:
db, cursor = connect_db()
show_databases(cursor)
db.close()

<class 'pymysql.connections.Connection'> connect
<class 'pymysql.cursors.Cursor'>
<class 'int'> 9 SHOW DATABASES
<class 'tuple'>
1 ('beauty_shop',)
1 ('employees',)
1 ('information_schema',)
1 ('mysql',)
1 ('performance_schema',)
1 ('sakila',)
1 ('sqldb',)
1 ('sys',)
1 ('world',)

### SHOW TABLES

In [4]:
db, cursor = connect_db("sqldb")
show_tables(cursor)
db.close()

<class 'pymysql.connections.Connection'> connect sqldb
<class 'pymysql.cursors.Cursor'>
<class 'int'> 10 SHOW TABLES
<class 'tuple'>
1 ('bigtbl1',)
1 ('bigtbl3',)
1 ('buytbl',)
1 ('membertbl',)
1 ('testtbl1',)
1 ('testtbl2',)
1 ('testtbl3',)
1 ('testtbl4',)
1 ('testtbl5',)
1 ('usertbl',)

### SELECT DATABASE()

In [5]:
db, cursor = connect_db()
select_database(cursor)
# use_database(cursor, "test")
use_database(cursor, "sqldb")
select_database(cursor)
db.close()

<class 'pymysql.connections.Connection'> connect
<class 'pymysql.cursors.Cursor'>
<class 'int'> 1 SELECT DATABASE()
<class 'tuple'>
1 (None,)
<class 'int'> 0 USE sqldb
<class 'int'> 1 SELECT DATABASE()
<class 'tuple'>
1 ('sqldb',)

## SQL

### DROP DATABASE

In [6]:
db, cursor = connect_db()
show_databases(cursor)
sql = "DROP DATABASE IF EXISTS ecommerce"
execute_sql(cursor, sql)
show_databases(cursor)
db.close()
print("close")

<class 'pymysql.connections.Connection'> connect
<class 'pymysql.cursors.Cursor'>
<class 'int'> 9 SHOW DATABASES
<class 'tuple'>
1 ('beauty_shop',)
1 ('employees',)
1 ('information_schema',)
1 ('mysql',)
1 ('performance_schema',)
1 ('sakila',)
1 ('sqldb',)
1 ('sys',)
1 ('world',)
<class 'int'> 0 DROP DATABASE IF EXISTS ecommerce
<class 'int'> 9 SHOW DATABASES
<class 'tuple'>
1 ('beauty_shop',)
1 ('employees',)
1 ('information_schema',)
1 ('mysql',)
1 ('performance_schema',)
1 ('sakila',)
1 ('sqldb',)
1 ('sys',)
1 ('world',)
close

### CREATE DATABASE

In [7]:
db, cursor = connect_db()
sql = "CREATE DATABASE IF NOT EXISTS ecommerce"
execute_sql(cursor, sql)
show_databases(cursor)
use_database(cursor, "ecommerce")
select_database(cursor)
db.close()
print("close")

<class 'pymysql.connections.Connection'> connect
<class 'pymysql.cursors.Cursor'>
<class 'int'> 1 CREATE DATABASE IF NOT EXISTS ecommerce
<class 'int'> 10 SHOW DATABASES
<class 'tuple'>
1 ('beauty_shop',)
1 ('ecommerce',)
1 ('employees',)
1 ('information_schema',)
1 ('mysql',)
1 ('performance_schema',)
1 ('sakila',)
1 ('sqldb',)
1 ('sys',)
1 ('world',)
<class 'int'> 0 USE ecommerce
<class 'int'> 1 SELECT DATABASE()
<class 'tuple'>
1 ('ecommerce',)
close

### DROP TABLE

In [8]:
db, cursor = connect_db("ecommerce")
show_tables(cursor)
sql = "DROP TABLE IF EXISTS {0}".format("product")
execute_sql(cursor, sql)
show_tables(cursor)
db.close()
print("close")

<class 'pymysql.connections.Connection'> connect ecommerce
<class 'pymysql.cursors.Cursor'>
<class 'int'> 0 SHOW TABLES
<class 'tuple'>
<class 'int'> 0 DROP TABLE IF EXISTS product
<class 'int'> 0 SHOW TABLES
<class 'tuple'>
close

### CREATE TABLE

In [9]:
sql = """
CREATE TABLE IF NOT EXISTS product (
PRODUCT_CODE VARCHAR(20) NOT NULL,
TITLE VARCHAR(200) NOT NULL,
ORI_PRICE INT,
DISCOUNT_PRICE INT,
DISCOUNT_PERCENT INT,
DELIVERY VARCHAR(2),
PRIMARY KEY(PRODUCT_CODE));
"""
db, cursor = connect_db("ecommerce")
show_tables(cursor)
execute_sql(cursor, sql)
show_tables(cursor)
db.close()
print("close")

<class 'pymysql.connections.Connection'> connect ecommerce
<class 'pymysql.cursors.Cursor'>
<class 'int'> 0 SHOW TABLES
<class 'tuple'>
<class 'int'> 0
CREATE TABLE IF NOT EXISTS product (
PRODUCT_CODE VARCHAR(20) NOT NULL,
TITLE VARCHAR(200) NOT NULL,
ORI_PRICE INT,
DISCOUNT_PRICE INT,
DISCOUNT_PERCENT INT,
DELIVERY VARCHAR(2),
PRIMARY KEY(PRODUCT_CODE));

<class 'int'> 1 SHOW TABLES
<class 'tuple'>
1 ('product',)
close

### SELECT

In [10]:
db, cursor = connect_db("ecommerce")
sql = "SELECT * FROM product"
execute_sql(cursor, sql)
result_tuple = cursor.fetchall()
print(type(result_tuple))
for row in result_tuple:
    print(row)
db.close()

<class 'pymysql.connections.Connection'> connect ecommerce
<class 'pymysql.cursors.Cursor'>
<class 'int'> 0 SELECT * FROM product
<class 'tuple'>

### INSERT

In [11]:
db, cursor = connect_db("ecommerce")
for i in range(3):
    product_code = 216573170 + i + 1
    sql = """
    INSERT INTO product (PRODUCT_CODE, TITLE, ORI_PRICE, DISCOUNT_PRICE, DISCOUNT_PERCENT, DELIVERY)
    VALUES ('%d', '%s', %d, %d, %d, '%s')""" % (product_code, "제목" + str(i), 10000, 8000, 20, "Y")
    execute_sql(cursor, sql)
db.commit()
db.close()

<class 'pymysql.connections.Connection'> connect ecommerce
<class 'pymysql.cursors.Cursor'>
<class 'int'> 1
    INSERT INTO product (PRODUCT_CODE, TITLE, ORI_PRICE, DISCOUNT_PRICE, DISCOUNT_PERCENT, DELIVERY)
    VALUES ('216573171', '제목0', 10000, 8000, 20, 'Y')
<class 'int'> 1
    INSERT INTO product (PRODUCT_CODE, TITLE, ORI_PRICE, DISCOUNT_PRICE, DISCOUNT_PERCENT, DELIVERY)
    VALUES ('216573172', '제목1', 10000, 8000, 20, 'Y')
<class 'int'> 1
    INSERT INTO product (PRODUCT_CODE, TITLE, ORI_PRICE, DISCOUNT_PRICE, DISCOUNT_PERCENT, DELIVERY)
    VALUES ('216573173', '제목2', 10000, 8000, 20, 'Y')

### UPDATE

In [12]:
db, cursor = connect_db("ecommerce")
sql = "UPDATE {table} SET {column}='{value}', DELIVERY='N' WHERE PRODUCT_CODE='{pk}'".format(table="product", column="title", value="test", pk="216573171")
execute_sql(cursor, sql)
db.commit()
db.close()

<class 'pymysql.connections.Connection'> connect ecommerce
<class 'pymysql.cursors.Cursor'>
<class 'int'> 1 UPDATE product SET title='test', DELIVERY='N' WHERE PRODUCT_CODE='216573171'

### DELETE

In [13]:
db, cursor = connect_db("ecommerce")
sql = "DELETE FROM {table} WHERE DELIVERY='{pk}'".format(table="product", pk="Y")
execute_sql(cursor, sql)
db.commit()
db.close()

<class 'pymysql.connections.Connection'> connect ecommerce
<class 'pymysql.cursors.Cursor'>
<class 'int'> 2 DELETE FROM product WHERE DELIVERY='Y'

## PANDAS

In [14]:
db, cursor = connect_db()
show_databases(cursor)
sql = "CREATE DATABASE IF NOT EXISTS student_mgmt;"
execute_sql(cursor, sql)
sql = "USE student_mgmt;"
execute_sql(cursor, sql)
show_tables(cursor)
sql = "DROP TABLE IF EXISTS students;"
execute_sql(cursor, sql)
sql = """
CREATE TABLE students (
id TINYINT NOT NULL AUTO_INCREMENT,
name VARCHAR(10) NOT NULL,
gender ENUM('man','woman') NOT NULL,
birth DATE NOT NULL,
english TINYINT NOT NULL,
math TINYINT NOT NULL,
korean TINYINT NOT NULL,
PRIMARY KEY (id)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
"""
execute_sql(cursor, sql)
show_tables(cursor)
sql = """
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('dave', 'man', '1983-07-16', 90, 80, 71);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('minsun', 'woman', '1982-10-16', 30, 88, 60);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('david', 'man', '1982-12-10', 78, 77, 30);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('jade', 'man', '1979-11-1', 45, 66, 20);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('jane', 'man', '1990-11-12', 65, 32, 90);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('wage', 'woman', '1982-1-13', 76, 30, 80);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('tina', 'woman', '1982-12-3', 87, 62, 71);
"""
sql_list = sql.split(";")
for sql in sql_list:
    sql = sql.strip()
    if sql:
        execute_sql(cursor, sql)
db.commit()
db.close()

<class 'pymysql.connections.Connection'> connect
<class 'pymysql.cursors.Cursor'>
<class 'int'> 10 SHOW DATABASES
<class 'tuple'>
1 ('beauty_shop',)
1 ('ecommerce',)
1 ('employees',)
1 ('information_schema',)
1 ('mysql',)
1 ('performance_schema',)
1 ('sakila',)
1 ('sqldb',)
1 ('sys',)
1 ('world',)
<class 'int'> 1 CREATE DATABASE IF NOT EXISTS student_mgmt;
<class 'int'> 0 USE student_mgmt;
<class 'int'> 0 SHOW TABLES
<class 'tuple'>
<class 'int'> 0 DROP TABLE IF EXISTS students;
<class 'int'> 0
CREATE TABLE students (
id TINYINT NOT NULL AUTO_INCREMENT,
name VARCHAR(10) NOT NULL,
gender ENUM('man','woman') NOT NULL,
birth DATE NOT NULL,
english TINYINT NOT NULL,
math TINYINT NOT NULL,
korean TINYINT NOT NULL,
PRIMARY KEY (id)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

<class 'int'> 1 SHOW TABLES
<class 'tuple'>
1 ('students',)
<class 'int'> 1 INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('dave', 'man', '1983-07-16', 90, 80, 71)
<class 'int'> 1 INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('minsun', 'woman', '1982-10-16', 30, 88, 60)
<class 'int'> 1 INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('david', 'man', '1982-12-10', 78, 77, 30)
<class 'int'> 1 INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('jade', 'man', '1979-11-1', 45, 66, 20)
<class 'int'> 1 INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('jane', 'man', '1990-11-12', 65, 32, 90)
<class 'int'> 1 INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('wage', 'woman', '1982-1-13', 76, 30, 80)
<class 'int'> 1 INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('tina', 'woman', '1982-12-3', 87, 62, 71)

In [15]:
db, cursor = connect_db("student_mgmt")
df = pd.read_sql("SELECT * FROM students", db)
db.close()
df

<class 'pymysql.connections.Connection'> connect student_mgmt
<class 'pymysql.cursors.Cursor'>

C:\Users\User\AppData\Local\Temp\ipykernel_3172\2896731721.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM students", db)

   id    name gender       birth  english  math  korean
0   1    dave    man  1983-07-16       90    80      71
1   2  minsun  woman  1982-10-16       30    88      60
2   3   david    man  1982-12-10       78    77      30
3   4    jade    man  1979-11-01       45    66      20
4   5    jane    man  1990-11-12       65    32      90
5   6    wage  woman  1982-01-13       76    30      80
6   7    tina  woman  1982-12-03       87    62      71

# 실습 (쇼핑목 크롤링하여 DB에 저장)

In [20]:
!pip install emoji

Collecting emoji
  Downloading emoji-2.15.0-py3-none-any.whl.metadata (5.7 kB)
Downloading emoji-2.15.0-py3-none-any.whl (608 kB)
   ---------------------------------------- 0.0/608.4 kB ? eta -:--:--
   ---------------------------------------- 0.0/608.4 kB ? eta -:--:--
   ---------------------------------------- 0.0/608.4 kB ? eta -:--:--
   ---------------------------------------- 0.0/608.4 kB ? eta -:--:--
   ---------------------------------------- 0.0/608.4 kB ? eta -:--:--
   ---------------------------------------- 0.0/608.4 kB ? eta -:--:--
   ----------------- ---------------------- 262.1/608.4 kB ? eta -:--:--
   ----------------- ---------------------- 262.1/608.4 kB ? eta -:--:--
   -------------------------------------- 608.4/608.4 kB 667.9 kB/s eta 0:00:00
Installing collected packages: emoji
Successfully installed emoji-2.15.0

In [21]:
from urllib.request import urlopen
from bs4 import BeautifulSoup
import pandas as pd
import numpy as np
import emoji

### database & table 생성

In [23]:
db, cursor = connect_db()
execute_sql(cursor, "DROP DATABASE IF EXISTS beauty_shop;")
execute_sql(cursor, "CREATE DATABASE IF NOT EXISTS beauty_shop;")
execute_sql(cursor, "USE beauty_shop;")
sql = '''
CREATE TABLE IF NOT EXISTS product (
PRODUCT_CODE int AUTO_INCREMENT NOT NULL,
TITLE VARCHAR(200) NOT NULL,
ORI_PRICE VARCHAR(100),
DISCOUNT_PRICE VARCHAR(100),
link VARCHAR(200),
PRIMARY KEY(PRODUCT_CODE)
);'''
execute_sql(cursor, sql)
desc_table(cursor, "product")
db.close()

<class 'pymysql.connections.Connection'> connect
<class 'pymysql.cursors.Cursor'>
<class 'int'> 1 DROP DATABASE IF EXISTS beauty_shop;
<class 'int'> 1 CREATE DATABASE IF NOT EXISTS beauty_shop;
<class 'int'> 0 USE beauty_shop;
<class 'int'> 0
CREATE TABLE IF NOT EXISTS product (
PRODUCT_CODE int AUTO_INCREMENT NOT NULL,
TITLE VARCHAR(200) NOT NULL,
ORI_PRICE VARCHAR(100),
DISCOUNT_PRICE VARCHAR(100),
link VARCHAR(200),
PRIMARY KEY(PRODUCT_CODE)
);
<class 'int'> 5 DESC product
<class 'tuple'>
6 ('PRODUCT_CODE', 'int', 'NO', 'PRI', None, 'auto_increment')
6 ('TITLE', 'varchar(200)', 'NO', '', None, '')
6 ('ORI_PRICE', 'varchar(100)', 'YES', '', None, '')
6 ('DISCOUNT_PRICE', 'varchar(100)', 'YES', '', None, '')
6 ('link', 'varchar(200)', 'YES', '', None, '')

### crawling & insert

In [49]:
from tqdm import tqdm

db, cursor = connect_db("beauty_shop")
cursor.execute("TRUNCATE TABLE product")
url = "http://jolse.com/category/toners-mists/1019/?page="
last_page = 10

for i in tqdm(range(1,last_page+1)):
    # page
    http_response = urlopen(url + str(i))
    html_bytes = http_response.read()
    bs = BeautifulSoup(html_bytes, "html.parser")
    # 한 페이지에 모든 상품이 들어있는 ul 태그 추출
    ul=bs_obj.find("ul",{"class":"prdList grid5"})
    # 품목 1개를 담고 있는 div 태그 추출
    prd_boxes = ul.findAll("div", {"class":"description"}) #1개 페이지의 전체 상품
    # 반환되는 품목 데이터를 db에 insert : 함수호출해서 진행
    for box in prd_boxes :
        # 제품정보 가져오기
        strong_tag = box.find("strong", {"class":"name"})
        # 품목 추출
        span =strong_tag.text.split(':',1)[1]
        # 세부 페이지 링크 추출
        a = strong_tag.find("a")
        sub_link = 'https://jolse.com' + a["href"]
        sub_link = emoji.replace_emoji(sub_link,'')
        # 가격 추출 코드
        price_ul = box.find("ul")
        old_price = price_ul.select("li")[0]
        old_price = old_price.select("span")[1].text
        old_price = old_price.split(" ")[1]
        dis_price = price_ul.select("li")[1]
        dis_price = dis_price.select("span")[1].text
        dis_price = dis_price.split(" ")[1]
        # 데이터 전처리
        title = span.replace("'","''") # ' 처리
        title = emoji.replace_emoji(title,'')
        # 세일 가격이 없는 경우
        if dis_price =='':
            dis_price = '0.0'
        # DB INSERT
        sql = "INSERT INTO product (title, ori_price, discount_price,link) values('{0}',{1},{2},'{3}')".format(title, old_price, dis_price, sub_link)
        cursor.execute(sql)
db.commit()
df = pd.read_sql("SELECT * FROM product", db)
db.close()
df

<class 'pymysql.connections.Connection'> connect beauty_shop
<class 'pymysql.cursors.Cursor'>

100%|██████████| 10/10 [00:10<00:00,  1.06s/it]
C:\Users\User\AppData\Local\Temp\ipykernel_3172\310333445.py:45: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM product", db)

,PRODUCT_CODE,TITLE,ORI_PRICE,DISCOUNT_PRICE,link
0,1,B : Lab Essence Toner Pad 10ea/25g,5.00,1.99,https://jolse.com/product/b-lab-essence-toner-...
1,2,EQQUALBERRY Swimming Pool Toner 300ml,22.00,15.40,https://jolse.com/product/eqqualberry-swimming...
2,3,celimax Jiwoogae Heartleaf BHA Peeling Pad 60...,17.50,13.12,https://jolse.com/product/celimax-jiwoogae-hea...
3,4,SKIN1004 Madagascar Centella Probio-Cica Esse...,24.00,14.49,https://jolse.com/product/skin1004-madagascar-...
4,5,Dr.Althea 345 Relief Cream Mist 100ml,19.90,13.93,https://jolse.com/product/dralthea-345-relief-...
...,...,...,...,...,...
395,396,SNP Glutathione PDRN Bright Turn-On Pad 170m...,24.00,14.40,https://jolse.com/product/snp-glutathione-pdrn...
396,397,COSRX AHA/BHA Clarifying Treatment Toner 50ml,8.50,6.80,https://jolse.com/product/cosrx-ahabha-clarify...
397,398,Anua BHA 2% Gentle Exfoliating Toner 150ml,23.00,19.55,https://jolse.com/product/anua-bha-2-gentle-ex...
398,399,Anua HEARTLEAF 77% SOOTHING TONER 40ml,8.00,6.80,https://jolse.com/product/anua-heartleaf-77-so...
399,400,JUMISO Waterfull Hyaluronic Acid Toner 250ml,22.00,15.40,https://jolse.com/product/jumiso-waterfull-hya...

# END